create_clock -name CLK -per 10 [get_ports Clock];
set_clock_latency -source 2 [get_clocks CLK];
set_clock_latency 1 [get_clocks CLK];
set_clock_uncertainty -setup 0.5 [get_clocks CLK];
set_clock_uncertainty -hold 0.1 [get_clocks CLK];
set_input_delay -max 3 -clock [get_clocks CLK] [get_ports Reset];
set_input_delay -min 1 -clock [get_clocks CLK] [get_ports Reset];
set_input_transition -max 0.5 [get_ports Reset];
set_input_transition -min 0.1 [get_ports Reset];
set_output_delay -max 3 -clock [get_clocks CLK] [get_ports Count_out];
set_output_delay -min 1 -clock [get_clocks CLK] [get_ports Count_out];
set_load -max 0.2 [get_ports Count_out];
set_load -min 0.1 [get_ports Count_out];
